In [11]:
import sqlite3
c = sqlite3.connect("trees.db")

def query(sql):
    return list(c.execute(sql))

In [13]:
query("select * from species")

[('m', 'maple'), ('p', 'pine')]

In [14]:
query("SELECT x, y FROM trees WHERE tree = 'C'")

[(30, 4)]

In [15]:
query("SELECT tree FROM trees")

[('A',), ('B',), ('C',), ('D',), ('E',)]

In [8]:
query("select * from species")

[(0, 'm', 'maple'), (1, 'p', 'pine')]

In [17]:
query("SELECT species FROM trees ORDER BY priority DESC")

[('m',), ('m',), ('m',), ('p',), ('p',)]

In [20]:
query("SELECT tree, priority FROM trees " +
      "ORDER BY priority DESC LIMIT 1")[0]

('B', 100)

In [21]:
vals = []
for row in query("SELECT x, y from trees"):
    vals.append(row[0])
print(sum(vals) / len(vals))

30.0

In [22]:
x = query("SELECT code FROM species WHERE species='maple' ")[0][0]
print(query("SELECT tree FROM trees WHERE species='{}' ".format(x)))

[('A',), ('B',), ('E',)]

In [26]:
for r in query("SELECT tree FROM trees ORDER BY diameter, priority"):
        print(r[0])

C
D
A
B
E

In [27]:
c.close()

In [28]:
import sqlite3
import pandas as pd

c = sqlite3.connect("fire.db")

def query(sql):
    return pd.read_sql(sql, c)

In [29]:
query("SELECT color, year FROM hydrants WHERE color = 'blue' ")

  color  year
0  blue  2010
1  blue  2014
2  blue  2018

In [31]:
df = query("SELECT color, year FROM hydrants")
df[df.color == "blue"]

  color  year
3  blue  2010
4  blue  2014
5  blue  2018

In [35]:
query("SELECT idx FROM hydrants WHERE owner='private' AND active")

   idx
0    3

In [42]:
df = query("SELECT year, style, active FROM hydrants")
df[df.active == 1]["style"]

2    Pacer
3    Pacer
4    Pacer
5    Pacer
Name: style, dtype: object

In [63]:
df = query("SELECT * FROM hydrants")
df[(df.alt > 1100) & (df.year > 2000)].idx.item()

6

In [64]:
query("SELECT year FROM hydrants").year.mean()

2007.0

In [65]:
query("SELECT year FROM hydrants WHERE color = 'blue' ").year.mean()

2014.0

In [66]:
df = query("SELECT * FROM hydrants ORDER BY year DESC LIMIT 2")
df.year.mean()

2016.0